Show / Hide Table of Contents
Class ExposureClassesDataEc2
Exposure Classes Ec2
Inheritance
System.Object
ExposureClassesDataEc2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ExposureClassesDataEc2
Constructors
Improve this Doc   View Source
ExposureClassesDataEc2()
Constructor
Declaration
public ExposureClassesDataEc2()
Properties
Improve this Doc   View Source
Carbonation
Combo box Carbonation
Declaration
public ExposureClassEc2 Carbonation { get; set; }
Property Value
 Type |  Description
 ExposureClassEc2
Improve this Doc   View Source
CarbonationCheck
Check box Carbonation
Declaration
public bool CarbonationCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
FreezeAttack
Combo box Freeze/Thaw Attack
Declaration
public ExposureClassEc2 FreezeAttack { get; set; }
Property Value
 Type |  Description
 ExposureClassEc2
Improve this Doc   View Source
FreezeAttackCheck
Check box Freeze/Thaw Attack
Declaration
public bool FreezeAttackCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ChemicalAttack
Combo box Chemical Attack
Declaration
public ExposureClassEc2 ChemicalAttack { get; set; }
Property Value
 Type |  Description
 ExposureClassEc2
Improve this Doc   View Source
ChemicalAttackCheck
Check box Chemical Attack
Declaration
public bool ChemicalAttackCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Chlorides
Combo box Chlorides
Declaration
public ExposureClassEc2 Chlorides { get; set; }
Property Value
 Type |  Description
 ExposureClassEc2
Improve this Doc   View Source
ChloridesFromSea
Combo box Chlorides from sea
Declaration
public ExposureClassEc2 ChloridesFromSea { get; set; }
Property Value
 Type |  Description
 ExposureClassEc2
Improve this Doc   View Source
ChloridesFromSeaCheck
Check box Chlorides from sea
Declaration
public bool ChloridesFromSeaCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ChloridesCheck
Check box Chlorides
Declaration
public bool ChloridesCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
NoCorrosionCheck
Check box No corrosion
Declaration
public bool NoCorrosionCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source